Revit 2024 API
ViewDrafting Class
 ViewDrafting represents a drafting view within the model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class ViewDrafting : View
Visual Basic
Public Class ViewDrafting _
	Inherits View
Visual C++
public ref class ViewDrafting : public View
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.View
 Autodesk.Revit.DB.ViewDrafting
 Autodesk.Revit.DB.ImageView
See Also
ViewDrafting Members
Autodesk.Revit.DB Namespace